Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxCan_bf.h
/** \brief Offset for Ifx_CAN_N_CCCR_Bits.TXP */
#define IFX_CAN_N_CCCR_TXP_OFF (14u)

/** \brief Length for Ifx_CAN_N_CCCR_Bits.NISO */
#define IFX_CAN_N_CCCR_NISO_LEN (1u)

/** \brief Mask for Ifx_CAN_N_CCCR_Bits.NISO */
#define IFX_CAN_N_CCCR_NISO_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_CCCR_Bits.NISO */
#define IFX_CAN_N_CCCR_NISO_OFF (15u)

/** \brief Length for Ifx_CAN_N_NBTP_Bits.NTSEG2 */
#define IFX_CAN_N_NBTP_NTSEG2_LEN (7u)

/** \brief Mask for Ifx_CAN_N_NBTP_Bits.NTSEG2 */
#define IFX_CAN_N_NBTP_NTSEG2_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_NBTP_Bits.NTSEG2 */
#define IFX_CAN_N_NBTP_NTSEG2_OFF (0u)

/** \brief Length for Ifx_CAN_N_NBTP_Bits.NTSEG1 */
#define IFX_CAN_N_NBTP_NTSEG1_LEN (8u)

/** \brief Mask for Ifx_CAN_N_NBTP_Bits.NTSEG1 */
#define IFX_CAN_N_NBTP_NTSEG1_MSK (0xffu)

/** \brief Offset for Ifx_CAN_N_NBTP_Bits.NTSEG1 */
#define IFX_CAN_N_NBTP_NTSEG1_OFF (8u)

/** \brief Length for Ifx_CAN_N_NBTP_Bits.NBRP */
#define IFX_CAN_N_NBTP_NBRP_LEN (9u)

/** \brief Mask for Ifx_CAN_N_NBTP_Bits.NBRP */
#define IFX_CAN_N_NBTP_NBRP_MSK (0x1ffu)

/** \brief Offset for Ifx_CAN_N_NBTP_Bits.NBRP */
#define IFX_CAN_N_NBTP_NBRP_OFF (16u)

/** \brief Length for Ifx_CAN_N_NBTP_Bits.NSJW */
#define IFX_CAN_N_NBTP_NSJW_LEN (7u)

/** \brief Mask for Ifx_CAN_N_NBTP_Bits.NSJW */
#define IFX_CAN_N_NBTP_NSJW_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_NBTP_Bits.NSJW */
#define IFX_CAN_N_NBTP_NSJW_OFF (25u)

/** \brief Length for Ifx_CAN_N_TSCC_Bits.TSS */
#define IFX_CAN_N_TSCC_TSS_LEN (2u)

/** \brief Mask for Ifx_CAN_N_TSCC_Bits.TSS */
#define IFX_CAN_N_TSCC_TSS_MSK (0x3u)

/** \brief Offset for Ifx_CAN_N_TSCC_Bits.TSS */
#define IFX_CAN_N_TSCC_TSS_OFF (0u)

/** \brief Length for Ifx_CAN_N_TSCC_Bits.TCP */
#define IFX_CAN_N_TSCC_TCP_LEN (4u)

/** \brief Mask for Ifx_CAN_N_TSCC_Bits.TCP */
#define IFX_CAN_N_TSCC_TCP_MSK (0xfu)

/** \brief Offset for Ifx_CAN_N_TSCC_Bits.TCP */
#define IFX_CAN_N_TSCC_TCP_OFF (16u)

/** \brief Length for Ifx_CAN_N_TSCV_Bits.TSC */
#define IFX_CAN_N_TSCV_TSC_LEN (16u)

/** \brief Mask for Ifx_CAN_N_TSCV_Bits.TSC */
#define IFX_CAN_N_TSCV_TSC_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_TSCV_Bits.TSC */
#define IFX_CAN_N_TSCV_TSC_OFF (0u)

/** \brief Length for Ifx_CAN_N_TOCC_Bits.ETOC */
#define IFX_CAN_N_TOCC_ETOC_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TOCC_Bits.ETOC */
#define IFX_CAN_N_TOCC_ETOC_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TOCC_Bits.ETOC */
#define IFX_CAN_N_TOCC_ETOC_OFF (0u)

/** \brief Length for Ifx_CAN_N_TOCC_Bits.TOS */
#define IFX_CAN_N_TOCC_TOS_LEN (2u)

/** \brief Mask for Ifx_CAN_N_TOCC_Bits.TOS */
#define IFX_CAN_N_TOCC_TOS_MSK (0x3u)

/** \brief Offset for Ifx_CAN_N_TOCC_Bits.TOS */
#define IFX_CAN_N_TOCC_TOS_OFF (1u)

/** \brief Length for Ifx_CAN_N_TOCC_Bits.TOP */
#define IFX_CAN_N_TOCC_TOP_LEN (16u)

/** \brief Mask for Ifx_CAN_N_TOCC_Bits.TOP */
#define IFX_CAN_N_TOCC_TOP_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_TOCC_Bits.TOP */
#define IFX_CAN_N_TOCC_TOP_OFF (16u)

/** \brief Length for Ifx_CAN_N_TOCV_Bits.TOC */
#define IFX_CAN_N_TOCV_TOC_LEN (16u)

/** \brief Mask for Ifx_CAN_N_TOCV_Bits.TOC */
#define IFX_CAN_N_TOCV_TOC_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_TOCV_Bits.TOC */
#define IFX_CAN_N_TOCV_TOC_OFF (0u)

/** \brief Length for Ifx_CAN_N_ECR_Bits.TEC */
#define IFX_CAN_N_ECR_TEC_LEN (8u)

/** \brief Mask for Ifx_CAN_N_ECR_Bits.TEC */
#define IFX_CAN_N_ECR_TEC_MSK (0xffu)

/** \brief Offset for Ifx_CAN_N_ECR_Bits.TEC */
#define IFX_CAN_N_ECR_TEC_OFF (0u)

/** \brief Length for Ifx_CAN_N_ECR_Bits.REC */
#define IFX_CAN_N_ECR_REC_LEN (7u)

/** \brief Mask for Ifx_CAN_N_ECR_Bits.REC */
#define IFX_CAN_N_ECR_REC_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_ECR_Bits.REC */
#define IFX_CAN_N_ECR_REC_OFF (8u)

/** \brief Length for Ifx_CAN_N_ECR_Bits.RP */
#define IFX_CAN_N_ECR_RP_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ECR_Bits.RP */
#define IFX_CAN_N_ECR_RP_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ECR_Bits.RP */
#define IFX_CAN_N_ECR_RP_OFF (15u)

/** \brief Length for Ifx_CAN_N_ECR_Bits.CEL */
#define IFX_CAN_N_ECR_CEL_LEN (8u)

/** \brief Mask for Ifx_CAN_N_ECR_Bits.CEL */
#define IFX_CAN_N_ECR_CEL_MSK (0xffu)

/** \brief Offset for Ifx_CAN_N_ECR_Bits.CEL */
#define IFX_CAN_N_ECR_CEL_OFF (16u)

/** \brief Length for Ifx_CAN_N_PSR_Bits.LEC */
#define IFX_CAN_N_PSR_LEC_LEN (3u)

/** \brief Mask for Ifx_CAN_N_PSR_Bits.LEC */
#define IFX_CAN_N_PSR_LEC_MSK (0x7u)

/** \brief Offset for Ifx_CAN_N_PSR_Bits.LEC */
#define IFX_CAN_N_PSR_LEC_OFF (0u)

/** \brief Length for Ifx_CAN_N_PSR_Bits.ACT */
#define IFX_CAN_N_PSR_ACT_LEN (2u)

/** \brief Mask for Ifx_CAN_N_PSR_Bits.ACT */
#define IFX_CAN_N_PSR_ACT_MSK (0x3u)

/** \brief Offset for Ifx_CAN_N_PSR_Bits.ACT */
#define IFX_CAN_N_PSR_ACT_OFF (3u)

/** \brief Length for Ifx_CAN_N_PSR_Bits.EP */
#define IFX_CAN_N_PSR_EP_LEN (1u)

/** \brief Mask for Ifx_CAN_N_PSR_Bits.EP */
#define IFX_CAN_N_PSR_EP_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_PSR_Bits.EP */
#define IFX_CAN_N_PSR_EP_OFF (5u)

/** \brief Length for Ifx_CAN_N_PSR_Bits.EW */
#define IFX_CAN_N_PSR_EW_LEN (1u)

/** \brief Mask for Ifx_CAN_N_PSR_Bits.EW */
#define IFX_CAN_N_PSR_EW_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_PSR_Bits.EW */
#define IFX_CAN_N_PSR_EW_OFF (6u)

/** \brief Length for Ifx_CAN_N_PSR_Bits.BO */
#define IFX_CAN_N_PSR_BO_LEN (1u)

/** \brief Mask for Ifx_CAN_N_PSR_Bits.BO */
#define IFX_CAN_N_PSR_BO_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_PSR_Bits.BO */
#define IFX_CAN_N_PSR_BO_OFF (7u)

/** \brief Length for Ifx_CAN_N_PSR_Bits.DLEC */
#define IFX_CAN_N_PSR_DLEC_LEN (3u)

/** \brief Mask for Ifx_CAN_N_PSR_Bits.DLEC */
#define IFX_CAN_N_PSR_DLEC_MSK (0x7u)

/** \brief Offset for Ifx_CAN_N_PSR_Bits.DLEC */
#define IFX_CAN_N_PSR_DLEC_OFF (8u)

/** \brief Length for Ifx_CAN_N_PSR_Bits.RESI */
#define IFX_CAN_N_PSR_RESI_LEN (1u)

/** \brief Mask for Ifx_CAN_N_PSR_Bits.RESI */
#define IFX_CAN_N_PSR_RESI_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_PSR_Bits.RESI */
#define IFX_CAN_N_PSR_RESI_OFF (11u)

